In [2]:
%run iac.py

IAM Role myRedshiftRole does not exist.
IAM Role myRedshiftRole created.
Redshift cluster 'redshift-cluster' already exists.
Waiting for Redshift cluster to be available...
Cluster 'redshift-cluster' is now available at redshift-cluster.cvkdtpgzlapv.us-west-2.redshift.amazonaws.com.
Configuration exported to dwh.cfg.

In [9]:
%run create_tables.py

Connecting to the database...
Connection established successfully.
Starting to drop tables...
Dropping table: stage_event (1/7)...
Table stage_event dropped successfully.
Dropping table: stage_song (2/7)...
Table stage_song dropped successfully.
Dropping table: songplays (3/7)...
Table songplays dropped successfully.
Dropping table: users (4/7)...
Table users dropped successfully.
Dropping table: songs (5/7)...
Table songs dropped successfully.
Dropping table: artists (6/7)...
Table artists dropped successfully.
Dropping table: time (7/7)...
Table time dropped successfully.
All drop table operations completed.
Starting to create tables...
Creating table: stage_event (1/7)...
Table stage_event created successfully.
Creating table: stage_song (2/7)...
Table stage_song created successfully.
Creating table: songplays (3/7)...
Table songplays created successfully.
Creating table: users (4/7)...
Table users created successfully.
Creating table: songs (5/7)...
Table songs created successfully.
Creating table: artists (6/7)...
Table artists created successfully.
Creating table: time (7/7)...
Table time created successfully.
All create table operations completed.
Database connection closed.

In [11]:
%run etl.py

Running...
Connection to Redshift established successfully.

Starting to load staging tables...
Executing COPY query 1/2...
COPY query 1/2 executed successfully.
Executing COPY query 2/2...
COPY query 2/2 executed successfully.

Starting to insert data into final tables...
Executing INSERT query 1/5...
INSERT query 1/5 executed successfully.
Executing INSERT query 2/5...
INSERT query 2/5 executed successfully.
Executing INSERT query 3/5...
INSERT query 3/5 executed successfully.
Executing INSERT query 4/5...
INSERT query 4/5 executed successfully.
Executing INSERT query 5/5...
INSERT query 5/5 executed successfully.
ETL process complete.

In [12]:
import pandas as pd
import psycopg2
import configparser
# Read DWH config
config_conn = configparser.ConfigParser()
config_conn.read('dwh.cfg')
# Run a query

query = ('''
SELECT * 
FROM artists
LIMIT 10
''')

conn = psycopg2.connect("host={} dbname={} user={} password={} port={}".format(*config_conn['CLUSTER'].values()))
df = pd.read_sql_query(query, conn)
conn.close()

df

/var/folders/0x/sytm1cbx2jn3ngxj6wfwv79m0000gn/T/ipykernel_71025/3323130156.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

,artist_id,name,location,latitude,longitude
0,AR00B1I1187FB433EB,Eagle-Eye Cherry,"Stockholm, Sweden",NaN,NaN
1,AR00DG71187B9B7FCB,Basslovers United,,NaN,NaN
2,AR00FVC1187FB5BE3E,Panda,"Monterrey, NL, México",25.6708,-100.3100
3,AR00JIO1187B9A5A15,Saigon,Brooklyn,40.6551,-73.9489
4,AR00LNI1187FB444A5,Bruce BecVar,,NaN,NaN
5,AR00MQ31187B9ACD8F,Chris Carrier,,NaN,NaN
6,AR00TGQ1187B994F29,Paula Toller,,NaN,NaN
7,AR00Y9I1187B999412,Akercocke,,NaN,NaN
8,AR00YYQ1187FB504DC,God Is My Co-Pilot,"New York, NY",40.7146,-74.0071
9,AR016P51187B98E398,Indian Ropeman,,NaN,NaN

# Caution: This function will close the Redshift cluster.

In [13]:
%run close.py

Cluster identifier is not provided in the configuration.
Detaching policies from IAM Role: myRedshiftRole
Detached policy arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess from role myRedshiftRole
Deleting IAM Role: myRedshiftRole
IAM Role myRedshiftRole deleted successfully.
Error deleting bucket: An error occurred (NoSuchBucket) when calling the ListObjectsV2 operation: The specified bucket does not exist